## indeing

la indexacion directasobre una serie devuelve uno de sus elementos y sobre un dataframe devuelve una d sus columnas

In [ ]:
import pandas as pd

In [ ]:
serie = pd.Series([5,7,2,4,3,9,8],index=['a','b','c','d','e','f','g'])
serie['b':'e'] #esto muestra desde x a Y lugar que digamos

b    7
c    2
d    4
e    3
dtype: int64

In [ ]:
ruta = r"C:\Users\balti\Desktop\Programacion\PYTHON\CURSOS\Analisis-de-datos\teoria\modulo 4\csv\titanic.csv"
data = pd.read_csv(ruta)
data['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [ ]:
data[['Survived','Age',"Name"]] # podemos hacer listas de que queremos que se muestre

     Survived   Age                                               Name
0           0  22.0                            Braund, Mr. Owen Harris
1           1  38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1  26.0                             Heikkinen, Miss. Laina
3           1  35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0  35.0                           Allen, Mr. William Henry
..        ...   ...                                                ...
886         0  27.0                              Montvila, Rev. Juozas
887         1  19.0                       Graham, Miss. Margaret Edith
888         0   NaN           Johnston, Miss. Catherine Helen "Carrie"
889         1  26.0                              Behr, Mr. Karl Howell
890         0  32.0                                Dooley, Mr. Patrick

[891 rows x 3 columns]

## label indexing
pandas provee un metodo para seleccionar elementos en base a las etiquetas atraves de __.loc__ , cuando se usa el .loc los numero representaran las etiquetas y no las posiciones, tambien se puede hacer slice con etiquetas

In [ ]:
data.loc[90,'Name'] # esto muesta el nombre numero 90

'Christmann, Mr. Emil'

In [ ]:
data.loc[25:30,'PassengerId':'Pclass'] # esto es un slice, muestra desde el 25 al 30

    PassengerId  Survived  Pclass
25           26         1       3
26           27         0       3
27           28         0       1
28           29         1       3
29           30         0       3
30           31         0       1

In [ ]:
data.loc[[25,30,200],['Survived','Age']] # aca me muiesta solo el 25 y el 30, los del medio no importan

     Survived   Age
25          1  38.0
30          0  40.0
200         0  28.0

## integer indexing

no solo existe el indexing .loc sino que tambien el __.iloc__ para acceder a elementos segun la posiciones, en este caso los numeros representan las posiciones y no las etiquetas

In [ ]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
data.iloc[125,4] # el primer numero representa que numero de posiciones quiero y el segundo que etiqueta quiero (columna), aca me muestra solo 1 dato

'male'

In [ ]:
data.iloc[10:18,-3:] # esto me muestra los ultimos 3 por el negativo, pero tambien podria hacer que me muestre los primero tres

       Fare Cabin Embarked
10  16.7000    G6        S
11  26.5500  C103        S
12   8.0500   NaN        S
13  31.2750   NaN        S
14   7.8542   NaN        S
15  16.0000   NaN        S
16  29.1250   NaN        Q
17  13.0000   NaN        S

In [ ]:
data.iloc[10:18,:3] # este me muestra los primeros 3

    PassengerId  Survived  Pclass
10           11         1       3
11           12         1       1
12           13         0       3
13           14         0       3
14           15         0       3
15           16         1       2
16           17         0       3
17           18         1       2

In [ ]:
data.iloc[[25,30],[2,5]] # selecciono cuales ilas quiero y que quiero de essa filas

    Pclass   Age
25       3  38.0
30       1  40.0

## FILTROS

tambien es posible seleccionar elementos segun condiciones de sus valores, la expresion condicional produce un arreglo booleano y devuleve los valores de ese array que sean verdadesro

In [ ]:
data[data['Age'] >= 30] # este data es como que diga 'data["mayores de 30"]'

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
data.loc[data['Age'] >= 30, ['Name',"Sex"]] # aca se combina loc con filtros pero lo que se hace es filtrar y despues los que cumplan eso solo se muestras lo que sea de interes, en este caso su nombre y su sexo

                                                  Name     Sex
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
6                              McCarthy, Mr. Timothy J    male
11                            Bonnell, Miss. Elizabeth  female
..                                                 ...     ...
873                        Vander Cruyssen, Mr. Victor    male
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female
881                                 Markun, Mr. Johann    male
885               Rice, Mrs. William (Margaret Norton)  female
890                                Dooley, Mr. Patrick    male

[330 rows x 2 columns]

: